bekencorp/armino/middleware/soc/bk7236/soc/sys_struct.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once

#ifdef __cplusplus
extern "C" {
#endif


typedef volatile union {
	struct {
		uint32_t deviceid                         : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_device_id_t;


typedef volatile union {
	struct {
		uint32_t versionid                        : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_version_id_t;


typedef volatile union {
	struct {
		uint32_t boot_mode                        :  1; /**<bit[0 : 0] */
		uint32_t reserved_bit_1_7                 :  7; /**<bit[1 : 7] */
		uint32_t jtag_core_sel                    :  1; /**<bit[8 : 8] */
		uint32_t flash_sel                        :  1; /**<bit[9 : 9] */
		uint32_t reserved_bit_10_31               : 22; /**<bit[10 : 31] */
	};
	uint32_t v;
} sys_cpu_storage_connect_op_select_t;


typedef volatile union {
	struct {
		uint32_t core0_halted                     :  1; /**<bit[0 : 0] */
		uint32_t core1_halted                     :  1; /**<bit[1 : 1] */
		uint32_t reserved_bit_2_3                 :  2; /**<bit[2 : 3] */
		uint32_t cpu0_sw_reset                    :  1; /**<bit[4 : 4] */
		uint32_t cpu1_sw_reset                    :  1; /**<bit[5 : 5] */
		uint32_t reserved_bit_6_7                 :  2; /**<bit[6 : 7] */
		uint32_t cpu0_pwr_dw_state                :  1; /**<bit[8 : 8] */
		uint32_t cpu1_pwr_dw_state                :  1; /**<bit[9 : 9] */
		uint32_t reserved_bit_10_31               : 22; /**<bit[10 : 31] */
	};
	uint32_t v;
} sys_cpu_current_run_status_t;


typedef volatile union {
	struct {
		uint32_t cpu0_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu0_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t cpu0_int_mask                    :  1; /**<bit[2 : 2] */
		uint32_t cpu0_halt                        :  1; /**<bit[3 : 3] */
		uint32_t reserved_4_7                     :  4; /**<bit[4 : 7] */
		uint32_t cpu0_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_halt_clk_op_t;


typedef volatile union {
	struct {
		uint32_t cpu1_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu1_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t cpu1_int_mask                    :  1; /**<bit[2 : 2] */
		uint32_t cpu1_halt                        :  1; /**<bit[3 : 3] */
		uint32_t cpu0_bus_clk_2div                :  1; /**<bit[4 : 4] */
		uint32_t reserved_5_7                     :  3; /**<bit[5 : 7] */
		uint32_t cpu1_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_halt_clk_op_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_31                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_reserved_reg0x6_t;


typedef volatile union {
	struct {
		uint32_t clkdiv_core                      :  4; /**<bit[0 : 3] */
		uint32_t cksel_core                       :  2; /**<bit[4 : 5] */
		uint32_t clkdiv_bus                       :  1; /**<bit[6 : 6] */
		uint32_t reserved_bit_7_7                 :  1; /**<bit[7 : 7] */
		uint32_t clkdiv_uart0                     :  2; /**<bit[8 : 9] */
		uint32_t clksel_uart0                     :  1; /**<bit[10 : 10] */
		uint32_t clkdiv_uart1                     :  2; /**<bit[11 : 12] */
		uint32_t cksel_uart1                      :  1; /**<bit[13 : 13] */
		uint32_t clkdiv_uart2                     :  2; /**<bit[14 : 15] */
		uint32_t cksel_uart2                      :  1; /**<bit[16 : 16] */
		uint32_t cksel_sadc                       :  1; /**<bit[17 : 17] */
		uint32_t cksel_pwm0                       :  1; /**<bit[18 : 18] */
		uint32_t cksel_pwm1                       :  1; /**<bit[19 : 19] */
		uint32_t cksel_tim0                       :  1; /**<bit[20 : 20] */
		uint32_t cksel_tim1                       :  1; /**<bit[21 : 21] */
		uint32_t cksel_tim2                       :  1; /**<bit[22 : 22] */
		uint32_t reserved_bit_23_23               :  1; /**<bit[23 : 23] */
		uint32_t cksel_i2s                        :  1; /**<bit[24 : 24] */
		uint32_t cksel_aud                        :  1; /**<bit[25 : 25] */
		uint32_t clkdiv_jpeg                      :  4; /**<bit[26 : 29] */
		uint32_t cksel_jpeg                       :  1; /**<bit[30 : 30] */
		uint32_t clkdiv_disp_l                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_clk_div_mode1_t;


typedef volatile union {
	struct {
		uint32_t clkdiv_disp_h                    :  3; /**<bit[0 : 2] */
		uint32_t cksel_disp                       :  1; /**<bit[3 : 3] */
		uint32_t ckdiv_psram                      :  1; /**<bit[4 : 4] */
		uint32_t cksel_psram                      :  1; /**<bit[5 : 5] */
		uint32_t ckdiv_qspi0                      :  4; /**<bit[6 : 9] */
		uint32_t reserved_10_13                   :  4; /**<bit[10 : 13] */
		uint32_t ckdiv_sdio                       :  3; /**<bit[14 : 16] */
		uint32_t cksel_sdio                       :  1; /**<bit[17 : 17] */
		uint32_t ckdiv_auxs                       :  4; /**<bit[18 : 21] */
		uint32_t cksel_auxs                       :  2; /**<bit[22 : 23] */
		uint32_t cksel_flash                      :  2; /**<bit[24 : 25] */
		uint32_t ckdiv_flash                      :  2; /**<bit[26 : 27] */
		uint32_t ckdiv_i2s0                       :  3; /**<bit[28 : 30] */
		uint32_t reserved_bit_31_31               :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_clk_div_mode2_t;


typedef volatile union {
	struct {
		uint32_t ckdiv_26m                        :  2; /**<bit[0 : 1] */
		uint32_t ckdiv_wdt                        :  2; /**<bit[2 : 3] */
		uint32_t clksel_spi0                      :  1; /**<bit[4 : 4] */
		uint32_t clksel_spi1                      :  1; /**<bit[5 : 5] */
		uint32_t reserved_bit_6_31                : 26; /**<bit[6 : 31] */
	};
	uint32_t v;
} sys_cpu_26m_wdt_clk_div_t;


typedef volatile union {
	struct {
		uint32_t anaspi_freq                      :  6; /**<bit[0 : 5] */
		uint32_t reserved_bit_6_31                : 26; /**<bit[6 : 31] */
	};
	uint32_t v;
} sys_cpu_anaspi_freq_t;


typedef volatile union {
	struct {
		uint32_t i2c0_cken                        :  1; /**<bit[0 : 0] */
		uint32_t spi0_cken                        :  1; /**<bit[1 : 1] */
		uint32_t uart0_cken                       :  1; /**<bit[2 : 2] */
		uint32_t pwm0_cken                        :  1; /**<bit[3 : 3] */
		uint32_t tim0_cken                        :  1; /**<bit[4 : 4] */
		uint32_t sadc_cken                        :  1; /**<bit[5 : 5] */
		uint32_t irda_cken                        :  1; /**<bit[6 : 6] */
		uint32_t efuse_cken                       :  1; /**<bit[7 : 7] */
		uint32_t i2c1_cken                        :  1; /**<bit[8 : 8] */
		uint32_t spi1_cken                        :  1; /**<bit[9 : 9] */
		uint32_t uart1_cken                       :  1; /**<bit[10 : 10] */
		uint32_t uart2_cken                       :  1; /**<bit[11 : 11] */
		uint32_t pwm1_cken                        :  1; /**<bit[12 : 12] */
		uint32_t tim1_cken                        :  1; /**<bit[13 : 13] */
		uint32_t tim2_cken                        :  1; /**<bit[14 : 14] */
		uint32_t otp_cken                         :  1; /**<bit[15 : 15] */
		uint32_t i2s_cken                         :  1; /**<bit[16 : 16] */
		uint32_t usb_cken                         :  1; /**<bit[17 : 17] */
		uint32_t can_cken                         :  1; /**<bit[18 : 18] */
		uint32_t psram_cken                       :  1; /**<bit[19 : 19] */
		uint32_t qspi0_cken                       :  1; /**<bit[20 : 20] */
		uint32_t qspi1_cken                       :  1; /**<bit[21 : 21] */
		uint32_t sdio_cken                        :  1; /**<bit[22 : 22] */
		uint32_t auxs_cken                        :  1; /**<bit[23 : 23] */
		uint32_t btdm_cken                        :  1; /**<bit[24 : 24] */
		uint32_t xvr_cken                         :  1; /**<bit[25 : 25] */
		uint32_t mac_cken                         :  1; /**<bit[26 : 26] */
		uint32_t phy_cken                         :  1; /**<bit[27 : 27] */
		uint32_t jpeg_cken                        :  1; /**<bit[28 : 28] */
		uint32_t disp_cken                        :  1; /**<bit[29 : 29] */
		uint32_t aud_cken                         :  1; /**<bit[30 : 30] */
		uint32_t wdt_cken                         :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_clk_enable_t;


typedef volatile union {
	struct {
		uint32_t h264_cken                        :  1; /**<bit[0 : 0] */
		uint32_t i2s1_cken                        :  1; /**<bit[1 : 1] */
		uint32_t i2s2_cken                        :  1; /**<bit[2 : 2] */
		uint32_t yuv_cken                         :  1; /**<bit[3 : 3] */
		uint32_t slcd_cken                        :  1; /**<bit[4 : 4] */
		uint32_t reserved_5_31                    : 27; /**<bit[5 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0xd_t;


typedef volatile union {
	struct {
		uint32_t uart1_mem_sd                     :  1; /**<bit[0 : 0] */
		uint32_t uart2                            :  1; /**<bit[1 : 1] */
		uint32_t spi1                             :  1; /**<bit[2 : 2] */
		uint32_t sdio                             :  1; /**<bit[3 : 3] */
		uint32_t usb                              :  1; /**<bit[4 : 4] */
		uint32_t can                              :  1; /**<bit[5 : 5] */
		uint32_t qspi0                            :  1; /**<bit[6 : 6] */
		uint32_t qspi1                            :  1; /**<bit[7 : 7] */
		uint32_t pram                             :  1; /**<bit[8 : 8] */
		uint32_t fft                              :  1; /**<bit[9 : 9] */
		uint32_t abc                              :  1; /**<bit[10 : 10] */
		uint32_t aud                              :  1; /**<bit[11 : 11] */
		uint32_t i2s0                             :  1; /**<bit[12 : 12] */
		uint32_t i2s1                             :  1; /**<bit[13 : 13] */
		uint32_t i2s2                             :  1; /**<bit[14 : 14] */
		uint32_t jpge                             :  1; /**<bit[15 : 15] */
		uint32_t yuv                              :  1; /**<bit[16 : 16] */
		uint32_t jpgd                             :  1; /**<bit[17 : 17] */
		uint32_t disp                             :  1; /**<bit[18 : 18] */
		uint32_t dmad                             :  1; /**<bit[19 : 19] */
		uint32_t h26f                             :  1; /**<bit[20 : 20] */
		uint32_t mac                              :  1; /**<bit[21 : 21] */
		uint32_t phy                              :  1; /**<bit[22 : 22] */
		uint32_t xvr                              :  1; /**<bit[23 : 23] */
		uint32_t irda                             :  1; /**<bit[24 : 24] */
		uint32_t la                               :  1; /**<bit[25 : 25] */
		uint32_t flsh                             :  1; /**<bit[26 : 26] */
		uint32_t uart                             :  1; /**<bit[27 : 27] */
		uint32_t spi0                             :  1; /**<bit[28 : 28] */
		uint32_t enc                              :  1; /**<bit[29 : 29] */
		uint32_t dma0                             :  1; /**<bit[30 : 30] */
		uint32_t dma1                             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl1_t;


typedef volatile union {
	struct {
		uint32_t uart1_mem_ds                     :  1; /**<bit[0 : 0] */
		uint32_t uart2                            :  1; /**<bit[1 : 1] */
		uint32_t spi1                             :  1; /**<bit[2 : 2] */
		uint32_t sdio                             :  1; /**<bit[3 : 3] */
		uint32_t usb                              :  1; /**<bit[4 : 4] */
		uint32_t can                              :  1; /**<bit[5 : 5] */
		uint32_t qspi0                            :  1; /**<bit[6 : 6] */
		uint32_t qspi1                            :  1; /**<bit[7 : 7] */
		uint32_t pram                             :  1; /**<bit[8 : 8] */
		uint32_t fft                              :  1; /**<bit[9 : 9] */
		uint32_t abc                              :  1; /**<bit[10 : 10] */
		uint32_t aud                              :  1; /**<bit[11 : 11] */
		uint32_t i2s0                             :  1; /**<bit[12 : 12] */
		uint32_t i2s1                             :  1; /**<bit[13 : 13] */
		uint32_t i2s2                             :  1; /**<bit[14 : 14] */
		uint32_t jpge                             :  1; /**<bit[15 : 15] */
		uint32_t yuv                              :  1; /**<bit[16 : 16] */
		uint32_t jpgd                             :  1; /**<bit[17 : 17] */
		uint32_t disp                             :  1; /**<bit[18 : 18] */
		uint32_t dmad                             :  1; /**<bit[19 : 19] */
		uint32_t h26f                             :  1; /**<bit[20 : 20] */
		uint32_t mac                              :  1; /**<bit[21 : 21] */
		uint32_t phy                              :  1; /**<bit[22 : 22] */
		uint32_t xvr                              :  1; /**<bit[23 : 23] */
		uint32_t irda                             :  1; /**<bit[24 : 24] */
		uint32_t la                               :  1; /**<bit[25 : 25] */
		uint32_t flsh                             :  1; /**<bit[26 : 26] */
		uint32_t uart                             :  1; /**<bit[27 : 27] */
		uint32_t spi0                             :  1; /**<bit[28 : 28] */
		uint32_t enc                              :  1; /**<bit[29 : 29] */
		uint32_t dma0                             :  1; /**<bit[30 : 30] */
		uint32_t dma1                             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl2_t;


typedef volatile union {
	struct {
		uint32_t pwd_mem1                         :  1; /**<bit[0 : 0] */
		uint32_t pwd_mem2                         :  1; /**<bit[1 : 1] */
		uint32_t pwd_mem3                         :  1; /**<bit[2 : 2] */
		uint32_t pwd_encp                         :  1; /**<bit[3 : 3] */
		uint32_t pwd_bakp                         :  1; /**<bit[4 : 4] */
		uint32_t pwd_ahbp                         :  1; /**<bit[5 : 5] */
		uint32_t pwd_audp                         :  1; /**<bit[6 : 6] */
		uint32_t pwd_vidp                         :  1; /**<bit[7 : 7] */
		uint32_t pwd_btsp                         :  1; /**<bit[8 : 8] */
		uint32_t pwd_wifp_mac                     :  1; /**<bit[9 : 9] */
		uint32_t pwd_wifp_phy                     :  1; /**<bit[10 : 10] */
		uint32_t pwd_mem0                         :  1; /**<bit[11 : 11] */
		uint32_t pwd_mem4                         :  1; /**<bit[12 : 12] */
		uint32_t pwd_ofdm                         :  1; /**<bit[13 : 13] */
		uint32_t tcm0_pgen                        :  1; /**<bit[14 : 14] */
		uint32_t rom_pgen                         :  1; /**<bit[15 : 15] */
		uint32_t sleep_en_need_flash_idle         :  1; /**<bit[16 : 16] */
		uint32_t sleep_en_need_cpu1_wfi           :  1; /**<bit[17 : 17] */
		uint32_t sleep_en_need_cpu0_wfi           :  1; /**<bit[18 : 18] */
		uint32_t sleep_en_global                  :  1; /**<bit[19 : 19] */
		uint32_t sleep_bus_idle_bypass            :  1; /**<bit[20 : 20] */
		uint32_t bts_wakeup_platform_en           :  1; /**<bit[21 : 21] */
		uint32_t bts_soft_wakeup_req              :  1; /**<bit[22 : 22] */
		uint32_t rom_rd_disable                   :  1; /**<bit[23 : 23] */
		uint32_t otp_rd_disable                   :  1; /**<bit[24 : 24] */
		uint32_t tcm1_pgen                        :  1; /**<bit[25 : 25] */
		uint32_t cpu0_subpwdm_en                  :  1; /**<bit[26 : 26] */
		uint32_t cpu1_subpwdm_en                  :  1; /**<bit[27 : 27] */
		uint32_t share_mem_clkgating_disable      :  1; /**<bit[28 : 28] */
		uint32_t cpu0_ticktimer_32k_enable        :  1; /**<bit[29 : 29] */
		uint32_t cpu1_ticktimer_32k_enable        :  1; /**<bit[30 : 30] */
		uint32_t reserved_bit_31_31               :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_power_sleep_wakeup_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_31                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x11_t;


typedef volatile union {
	struct {
		uint32_t ram0_mem_ds_deep_sleep           :  1; /**<bit[0 : 0] */
		uint32_t ram1_deep_sleep                  :  1; /**<bit[1 : 1] */
		uint32_t ram2_deep_sleep                  :  1; /**<bit[2 : 2] */
		uint32_t ram3_deep_sleep                  :  1; /**<bit[3 : 3] */
		uint32_t ram4_deep_sleep                  :  1; /**<bit[4 : 4] */
		uint32_t cpu0_icache_itag_deep_sleep      :  1; /**<bit[5 : 5] */
		uint32_t cpu0_dcache_dtag_deep_sleep      :  1; /**<bit[6 : 6] */
		uint32_t cpu1_icache_itag_deep_sleep      :  1; /**<bit[7 : 7] */
		uint32_t cpu1_dcache_dtag_deep_sleep      :  1; /**<bit[8 : 8] */
		uint32_t cpu0_itcm_deep_sleep             :  1; /**<bit[9 : 9] */
		uint32_t cpu0_dtcm_deep_sleep             :  1; /**<bit[10 : 10] */
		uint32_t cpu1_itcm_deep_sleep             :  1; /**<bit[11 : 11] */
		uint32_t cpu1_dtcm_deep_sleep             :  1; /**<bit[12 : 12] */
		uint32_t rott_deep_sleep                  :  1; /**<bit[13 : 13] */
		uint32_t reserved0                        :  1; /**<bit[14 : 14] */
		uint32_t reserved1                        :  1; /**<bit[15 : 15] */
		uint32_t ram0_mem_sd_shutdown             :  1; /**<bit[16 : 16] */
		uint32_t ram1_shutdown                    :  1; /**<bit[17 : 17] */
		uint32_t ram2_shutdown                    :  1; /**<bit[18 : 18] */
		uint32_t ram3_shutdown                    :  1; /**<bit[19 : 19] */
		uint32_t ram4_shutdown                    :  1; /**<bit[20 : 20] */
		uint32_t cpu0_icache_itag_shutdown        :  1; /**<bit[21 : 21] */
		uint32_t cpu0_dcache_dtag_shutdown        :  1; /**<bit[22 : 22] */
		uint32_t cpu1_icache_itag_shutdown        :  1; /**<bit[23 : 23] */
		uint32_t cpu1_dcache_dtag_shutdown        :  1; /**<bit[24 : 24] */
		uint32_t cpu0_itcm_shutdown               :  1; /**<bit[25 : 25] */
		uint32_t cpu0_dtcm_shutdown               :  1; /**<bit[26 : 26] */
		uint32_t cpu1_itcm_shutdown               :  1; /**<bit[27 : 27] */
		uint32_t cpu1_dtcm_shutdown               :  1; /**<bit[28 : 28] */
		uint32_t rott_shutdown                    :  1; /**<bit[29 : 29] */
		uint32_t reserved2                        :  1; /**<bit[30 : 30] */
		uint32_t reserved3                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl3_t;


typedef volatile union {
	struct {
		uint32_t cpu0_dma0_nsec_intr_en           :  1; /**<bit[0 : 0] */
		uint32_t cpu0_encp_sec_intr_en            :  1; /**<bit[1 : 1] */
		uint32_t cpu0_encp_nsec_intr_en           :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer0_int_en               :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu0_sdio_int_en                 :  1; /**<bit[10 : 10] */
		uint32_t cpu0_gdma_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_timer1_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_i2c1_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_uart2_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_spi1_int_en                 :  1; /**<bit[17 : 17] */
		uint32_t cpu0_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_usb_int_en                  :  1; /**<bit[19 : 19] */
		uint32_t cpu0_qspi0_int_en                :  1; /**<bit[20 : 20] */
		uint32_t cpu0_fft_int_en                  :  1; /**<bit[21 : 21] */
		uint32_t cpu0_sbc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_jpegenc_int_en              :  1; /**<bit[25 : 25] */
		uint32_t cpu0_jpegdec_int_en              :  1; /**<bit[26 : 26] */
		uint32_t cpu0_lcd_display_int_en          :  1; /**<bit[27 : 27] */
		uint32_t cpu0_dma2d_int_en                :  1; /**<bit[28 : 28] */
		uint32_t cpu0_wifi_int_phy_mpb_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu0_wifi_int_phy_riu_en         :  1; /**<bit[30 : 30] */
		uint32_t cpu0_wifi_mac_int_tx_rx_timer_en :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu0_wifi_mac_int_tx_rx_misc_en  :  1; /**<bit[0 : 0] */
		uint32_t cpu0_wifi_mac_int_rx_trigger_en  :  1; /**<bit[1 : 1] */
		uint32_t cpu0_wifi_mac_int_tx_trigger_en  :  1; /**<bit[2 : 2] */
		uint32_t cpu0_wifi_mac_int_prot_trigger_en :  1; /**<bit[3 : 3] */
		uint32_t cpu0_wifi_mac_int_gen_en         :  1; /**<bit[4 : 4] */
		uint32_t cpu0_wifi_hsu_irq_en             :  1; /**<bit[5 : 5] */
		uint32_t cpu0_wifi_int_mac_wakeup_en      :  1; /**<bit[6 : 6] */
		uint32_t cpu0_dm_irq_en                   :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_en                  :  1; /**<bit[8 : 8] */
		uint32_t cpu0_bt_irq_en                   :  1; /**<bit[9 : 9] */
		uint32_t cpu0_qspi1_int_en                :  1; /**<bit[10 : 10] */
		uint32_t cpu0_pwm1_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_i2s1_int_en                 :  1; /**<bit[12 : 12] */
		uint32_t cpu0_i2s2_int_en                 :  1; /**<bit[13 : 13] */
		uint32_t cpu0_h264_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_sdmadc_int_en               :  1; /**<bit[15 : 15] */
		uint32_t cpu0_mbox0_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_mbox1_int_en                :  1; /**<bit[17 : 17] */
		uint32_t cpu0_bmc64_int_en                :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpll_unlock_int_en          :  1; /**<bit[19 : 19] */
		uint32_t cpu0_touched_int_en              :  1; /**<bit[20 : 20] */
		uint32_t cpu0_usbplug_int_en              :  1; /**<bit[21 : 21] */
		uint32_t cpu0_rtc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_int_en                 :  1; /**<bit[23 : 23] */
		uint32_t cpu0_dma1_sec_int_en             :  1; /**<bit[24 : 24] */
		uint32_t cpu0_dma1_nsec_int_en            :  1; /**<bit[25 : 25] */
		uint32_t cpu0_yuvb_int_en                 :  1; /**<bit[26 : 26] */
		uint32_t reserved0                        :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_32_63_en_t;


