bekencorp/armino/middleware/soc/bk7236/soc/sys_struct.h
typedef volatile union {
	struct {
		uint32_t cpu1_dma0_nsec_intr_en           :  1; /**<bit[0 : 0] */
		uint32_t cpu1_encp_sec_intr_en            :  1; /**<bit[1 : 1] */
		uint32_t cpu1_encp_nsec_intr_en           :  1; /**<bit[2 : 2] */
		uint32_t cpu1_timer0_int_en               :  1; /**<bit[3 : 3] */
		uint32_t cpu1_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu1_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu1_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu1_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu1_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu1_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu1_sdio_int_en                 :  1; /**<bit[10 : 10] */
		uint32_t cpu1_gdma_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu1_timer1_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu1_i2c1_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu1_uart2_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_spi1_int_en                 :  1; /**<bit[17 : 17] */
		uint32_t cpu1_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu1_usb_int_en                  :  1; /**<bit[19 : 19] */
		uint32_t cpu1_qspi0_int_en                :  1; /**<bit[20 : 20] */
		uint32_t cpu1_fft_int_en                  :  1; /**<bit[21 : 21] */
		uint32_t cpu1_sbc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu1_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu1_jpegenc_int_en              :  1; /**<bit[25 : 25] */
		uint32_t cpu1_jpegdec_int_en              :  1; /**<bit[26 : 26] */
		uint32_t cpu1_lcd_display_int_en          :  1; /**<bit[27 : 27] */
		uint32_t cpu1_dma2d_int_en                :  1; /**<bit[28 : 28] */
		uint32_t cpu1_wifi_int_phy_mpb_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu1_wifi_int_phy_riu_en         :  1; /**<bit[30 : 30] */
		uint32_t cpu1_wifi_mac_int_tx_rx_timer_en :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_wifi_mac_int_tx_rx_misc_en  :  1; /**<bit[0 : 0] */
		uint32_t cpu1_wifi_mac_int_rx_trigger_en  :  1; /**<bit[1 : 1] */
		uint32_t cpu1_wifi_mac_int_tx_trigger_en  :  1; /**<bit[2 : 2] */
		uint32_t cpu1_wifi_mac_int_prot_trigger_en :  1; /**<bit[3 : 3] */
		uint32_t cpu1_wifi_mac_int_gen_en         :  1; /**<bit[4 : 4] */
		uint32_t cpu1_wifi_hsu_irq_en             :  1; /**<bit[5 : 5] */
		uint32_t cpu1_wifi_int_mac_wakeup_en      :  1; /**<bit[6 : 6] */
		uint32_t cpu1_dm_irq_en                   :  1; /**<bit[7 : 7] */
		uint32_t cpu1_ble_irq_en                  :  1; /**<bit[8 : 8] */
		uint32_t cpu1_bt_irq_en                   :  1; /**<bit[9 : 9] */
		uint32_t cpu1_qspi1_int_en                :  1; /**<bit[10 : 10] */
		uint32_t cpu1_pwm1_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_i2s1_int_en                 :  1; /**<bit[12 : 12] */
		uint32_t cpu1_i2s2_int_en                 :  1; /**<bit[13 : 13] */
		uint32_t cpu1_h264_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_sdmadc_int_en               :  1; /**<bit[15 : 15] */
		uint32_t cpu1_mbox0_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_mbox1_int_en                :  1; /**<bit[17 : 17] */
		uint32_t cpu1_bmc64_int_en                :  1; /**<bit[18 : 18] */
		uint32_t cpu1_dpll_unlock_int_en          :  1; /**<bit[19 : 19] */
		uint32_t cpu1_touched_int_en              :  1; /**<bit[20 : 20] */
		uint32_t cpu1_usbplug_int_en              :  1; /**<bit[21 : 21] */
		uint32_t cpu1_rtc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_gpio_int_en                 :  1; /**<bit[23 : 23] */
		uint32_t cpu1_dma1_sec_int_en             :  1; /**<bit[24 : 24] */
		uint32_t cpu1_dma1_nsec_int_en            :  1; /**<bit[25 : 25] */
		uint32_t cpu1_yuvb_int_en                 :  1; /**<bit[26 : 26] */
		uint32_t reserved0                        :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_32_63_en_t;


typedef volatile union {
	struct {
		uint32_t cpu0_dma0_nsec_intr_st           :  1; /**<bit[0 : 0] */
		uint32_t cpu0_encp_sec_intr_st            :  1; /**<bit[1 : 1] */
		uint32_t cpu0_encp_nsec_intr_st           :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer0_int_st               :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart_int_st                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_st                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_st                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_st                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_st                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda_int_st                 :  1; /**<bit[9 : 9] */
		uint32_t cpu0_sdio_int_st                 :  1; /**<bit[10 : 10] */
		uint32_t cpu0_gdma_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_st                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_timer1_int_st               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_i2c1_int_st                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_st                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_uart2_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_spi1_int_st                 :  1; /**<bit[17 : 17] */
		uint32_t cpu0_can_int_st                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_usb_int_st                  :  1; /**<bit[19 : 19] */
		uint32_t cpu0_qspi0_int_st                :  1; /**<bit[20 : 20] */
		uint32_t cpu0_fft_int_st                  :  1; /**<bit[21 : 21] */
		uint32_t cpu0_sbc_int_st                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_aud_int_st                  :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_st                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_jpegenc_int_st              :  1; /**<bit[25 : 25] */
		uint32_t cpu0_jpegdec_int_st              :  1; /**<bit[26 : 26] */
		uint32_t cpu0_lcd_display_int_st          :  1; /**<bit[27 : 27] */
		uint32_t cpu0_dma2d_int_st                :  1; /**<bit[28 : 28] */
		uint32_t cpu0_wifi_int_phy_mpb_st         :  1; /**<bit[29 : 29] */
		uint32_t cpu0_wifi_int_phy_riu_st         :  1; /**<bit[30 : 30] */
		uint32_t cpu0_wifi_mac_int_tx_rx_timer_st :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_0_31_status_t;


typedef volatile union {
	struct {
		uint32_t cpu0_wifi_mac_int_tx_rx_misc_st  :  1; /**<bit[0 : 0] */
		uint32_t cpu0_wifi_mac_int_rx_trigger_st  :  1; /**<bit[1 : 1] */
		uint32_t cpu0_wifi_mac_int_tx_trigger_st  :  1; /**<bit[2 : 2] */
		uint32_t cpu0_wifi_mac_int_prot_trigger_st :  1; /**<bit[3 : 3] */
		uint32_t cpu0_wifi_mac_int_gen_st         :  1; /**<bit[4 : 4] */
		uint32_t cpu0_wifi_hsu_irq_st             :  1; /**<bit[5 : 5] */
		uint32_t cpu0_wifi_int_mac_wakeup_st      :  1; /**<bit[6 : 6] */
		uint32_t cpu0_dm_irq_st                   :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_st                  :  1; /**<bit[8 : 8] */
		uint32_t cpu0_bt_irq_st                   :  1; /**<bit[9 : 9] */
		uint32_t cpu0_qspi1_int_st                :  1; /**<bit[10 : 10] */
		uint32_t cpu0_pwm1_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_i2s1_int_st                 :  1; /**<bit[12 : 12] */
		uint32_t cpu0_i2s2_int_st                 :  1; /**<bit[13 : 13] */
		uint32_t cpu0_h264_int_st                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_sdmadc_int_st               :  1; /**<bit[15 : 15] */
		uint32_t cpu0_mbox0_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_mbox1_int_st                :  1; /**<bit[17 : 17] */
		uint32_t cpu0_bmc64_int_st                :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpll_unlock_int_st          :  1; /**<bit[19 : 19] */
		uint32_t cpu0_touched_int_st              :  1; /**<bit[20 : 20] */
		uint32_t cpu0_usbplug_int_st              :  1; /**<bit[21 : 21] */
		uint32_t cpu0_rtc_int_st                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_int_st                 :  1; /**<bit[23 : 23] */
		uint32_t cpu0_dma1_sec_int_st             :  1; /**<bit[24 : 24] */
		uint32_t cpu0_dma1_nsec_int_st            :  1; /**<bit[25 : 25] */
		uint32_t cpu0_yuvb_int_st                 :  1; /**<bit[26 : 26] */
		uint32_t reserved0                        :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_32_63_status_t;


typedef volatile union {
	struct {
		uint32_t cpu1_dma0_nsec_intr_st           :  1; /**<bit[0 : 0] */
		uint32_t cpu1_encp_sec_intr_st            :  1; /**<bit[1 : 1] */
		uint32_t cpu1_encp_nsec_intr_st           :  1; /**<bit[2 : 2] */
		uint32_t cpu1_timer0_int_st               :  1; /**<bit[3 : 3] */
		uint32_t cpu1_uart_int_st                 :  1; /**<bit[4 : 4] */
		uint32_t cpu1_pwm0_int_st                 :  1; /**<bit[5 : 5] */
		uint32_t cpu1_i2c0_int_st                 :  1; /**<bit[6 : 6] */
		uint32_t cpu1_spi0_int_st                 :  1; /**<bit[7 : 7] */
		uint32_t cpu1_sadc_int_st                 :  1; /**<bit[8 : 8] */
		uint32_t cpu1_irda_int_st                 :  1; /**<bit[9 : 9] */
		uint32_t cpu1_sdio_int_st                 :  1; /**<bit[10 : 10] */
		uint32_t cpu1_gdma_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_la_int_st                   :  1; /**<bit[12 : 12] */
		uint32_t cpu1_timer1_int_st               :  1; /**<bit[13 : 13] */
		uint32_t cpu1_i2c1_int_st                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_uart1_int_st                :  1; /**<bit[15 : 15] */
		uint32_t cpu1_uart2_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_spi1_int_st                 :  1; /**<bit[17 : 17] */
		uint32_t cpu1_can_int_st                  :  1; /**<bit[18 : 18] */
		uint32_t cpu1_usb_int_st                  :  1; /**<bit[19 : 19] */
		uint32_t cpu1_qspi0_int_st                :  1; /**<bit[20 : 20] */
		uint32_t cpu1_fft_int_st                  :  1; /**<bit[21 : 21] */
		uint32_t cpu1_sbc_int_st                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_aud_int_st                  :  1; /**<bit[23 : 23] */
		uint32_t cpu1_i2s0_int_st                 :  1; /**<bit[24 : 24] */
		uint32_t cpu1_jpegenc_int_st              :  1; /**<bit[25 : 25] */
		uint32_t cpu1_jpegdec_int_st              :  1; /**<bit[26 : 26] */
		uint32_t cpu1_lcd_display_int_st          :  1; /**<bit[27 : 27] */
		uint32_t cpu1_dma2d_int_st                :  1; /**<bit[28 : 28] */
		uint32_t cpu1_wifi_int_phy_mpb_st         :  1; /**<bit[29 : 29] */
		uint32_t cpu1_wifi_int_phy_riu_st         :  1; /**<bit[30 : 30] */
		uint32_t cpu1_wifi_mac_int_tx_rx_timer_st :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_0_31_status_t;


typedef volatile union {
	struct {
		uint32_t cpu1_wifi_mac_int_tx_rx_misc_st  :  1; /**<bit[0 : 0] */
		uint32_t cpu1_wifi_mac_int_rx_trigger_st  :  1; /**<bit[1 : 1] */
		uint32_t cpu1_wifi_mac_int_tx_trigger_st  :  1; /**<bit[2 : 2] */
		uint32_t cpu1_wifi_mac_int_prot_trigger_st :  1; /**<bit[3 : 3] */
		uint32_t cpu1_wifi_mac_int_gen_st         :  1; /**<bit[4 : 4] */
		uint32_t cpu1_wifi_hsu_irq_st             :  1; /**<bit[5 : 5] */
		uint32_t cpu1_wifi_int_mac_wakeup_st      :  1; /**<bit[6 : 6] */
		uint32_t cpu1_dm_irq_st                   :  1; /**<bit[7 : 7] */
		uint32_t cpu1_ble_irq_st                  :  1; /**<bit[8 : 8] */
		uint32_t cpu1_bt_irq_st                   :  1; /**<bit[9 : 9] */
		uint32_t cpu1_qspi1_int_st                :  1; /**<bit[10 : 10] */
		uint32_t cpu1_pwm1_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_i2s1_int_st                 :  1; /**<bit[12 : 12] */
		uint32_t cpu1_i2s2_int_st                 :  1; /**<bit[13 : 13] */
		uint32_t cpu1_h264_int_st                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_sdmadc_int_st               :  1; /**<bit[15 : 15] */
		uint32_t cpu1_mbox0_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_mbox1_int_st                :  1; /**<bit[17 : 17] */
		uint32_t cpu1_bmc64_int_st                :  1; /**<bit[18 : 18] */
		uint32_t cpu1_dpll_unlock_int_st          :  1; /**<bit[19 : 19] */
		uint32_t cpu1_touched_int_st              :  1; /**<bit[20 : 20] */
		uint32_t cpu1_usbplug_int_st              :  1; /**<bit[21 : 21] */
		uint32_t cpu1_rtc_int_st                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_gpio_int_st                 :  1; /**<bit[23 : 23] */
		uint32_t cpu1_dma1_sec_int_st             :  1; /**<bit[24 : 24] */
		uint32_t cpu1_dma1_nsec_int_st            :  1; /**<bit[25 : 25] */
		uint32_t cpu1_yuvb_int_st                 :  1; /**<bit[26 : 26] */
		uint32_t reserved0                        :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_32_63_status_t;


typedef volatile union {
	struct {
		uint32_t gpio_config0                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_config0_t;


typedef volatile union {
	struct {
		uint32_t gpio_config1                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_config1_t;


typedef volatile union {
	struct {
		uint32_t gpio_config2                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_config2_t;


typedef volatile union {
	struct {
		uint32_t gpio_config3                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_config3_t;


typedef volatile union {
	struct {
		uint32_t gpio_config4                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_config4_t;


typedef volatile union {
	struct {
		uint32_t gpio_config5                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_config5_t;


typedef volatile union {
	struct {
		uint32_t dbug_config0                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_sys_debug_config0_t;


typedef volatile union {
	struct {
		uint32_t dbug_config1                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_sys_debug_config1_t;


typedef volatile union {
	struct {
		uint32_t dpll_tsten                       :  1; /**<bit[0 : 0] */
		uint32_t cp                               :  3; /**<bit[1 : 3] */
		uint32_t spideten                         :  1; /**<bit[4 : 4] */
		uint32_t hvref                            :  2; /**<bit[5 : 6] */
		uint32_t lvref                            :  2; /**<bit[7 : 8] */
		uint32_t rzctrl26m                        :  1; /**<bit[9 : 9] */
		uint32_t looprzctrl                       :  4; /**<bit[10 : 13] */
		uint32_t rpc                              :  2; /**<bit[14 : 15] */
		uint32_t openloop_en                      :  1; /**<bit[16 : 16] */
		uint32_t cksel                            :  2; /**<bit[17 : 18] */
		uint32_t spitrig                          :  1; /**<bit[19 : 19] */
		uint32_t band0                            :  1; /**<bit[20 : 20] */
		uint32_t band1                            :  1; /**<bit[21 : 21] */
		uint32_t band                             :  3; /**<bit[22 : 24] */
		uint32_t bandmanual                       :  1; /**<bit[25 : 25] */
		uint32_t dsptrig                          :  1; /**<bit[26 : 26] */
		uint32_t lpen_dpll                        :  1; /**<bit[27 : 27] */
		uint32_t nc_28_30                         :  3; /**<bit[28 : 30] */
		uint32_t vctrl_dpllldo                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg0_t;


typedef volatile union {
	struct {
		uint32_t nc3                              :  1; /**<bit[0 : 0] */
		uint32_t nc2                              :  1; /**<bit[1 : 1] */
		uint32_t msw                              :  9; /**<bit[2 : 10] */
		uint32_t ictrl                            :  3; /**<bit[11 : 13] */
		uint32_t osc_trig                         :  1; /**<bit[14 : 14] */
		uint32_t osccal_trig                      :  1; /**<bit[15 : 15] */
		uint32_t cnti                             :  9; /**<bit[16 : 24] */
		uint32_t spi_rst                          :  1; /**<bit[25 : 25] */
		uint32_t amsel                            :  1; /**<bit[26 : 26] */
		uint32_t divctrl                          :  3; /**<bit[27 : 29] */
		uint32_t nc1                              :  1; /**<bit[30 : 30] */
		uint32_t nc0                              :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg1_t;


typedef volatile union {
	struct {
		uint32_t xtalh_ctune                      :  8; /**<bit[0 : 7] */
		uint32_t force_26mpll                     :  1; /**<bit[8 : 8] */
		uint32_t gadc_cmp_ictrl                   :  2; /**<bit[9 : 10] */
		uint32_t gadc_inbuf_ictrl                 :  2; /**<bit[11 : 12] */
		uint32_t gadc_refbuf_ictrl                :  2; /**<bit[13 : 14] */
		uint32_t gadc_nobuf_enable                :  1; /**<bit[15 : 15] */
		uint32_t vref_scale                       :  1; /**<bit[16 : 16] */
		uint32_t scal_en                          :  1; /**<bit[17 : 17] */
		uint32_t gadc_capcal_en                   :  1; /**<bit[18 : 18] */
		uint32_t gadc_capcal                      :  6; /**<bit[19 : 24] */
		uint32_t sp_nt_ctrl                       :  7; /**<bit[25 : 31] */
	};
	uint32_t v;
} sys_ana_reg2_t;


typedef volatile union {
	struct {
		uint32_t usbpen                           :  4; /**<bit[0 : 3] */
		uint32_t usbnen                           :  4; /**<bit[4 : 7] */
		uint32_t hpssren                          :  1; /**<bit[8 : 8] */
		uint32_t ck_sel                           :  1; /**<bit[9 : 9] */
		uint32_t anabuf_sel_rx                    :  1; /**<bit[10 : 10] */
		uint32_t pwd_xtalldo                      :  1; /**<bit[11 : 11] */
		uint32_t iamp                             :  1; /**<bit[12 : 12] */
		uint32_t vddren                           :  1; /**<bit[13 : 13] */
		uint32_t xamp                             :  6; /**<bit[14 : 19] */
		uint32_t vosel                            :  5; /**<bit[20 : 24] */
		uint32_t en_xtalh_sleep                   :  1; /**<bit[25 : 25] */
		uint32_t xtal40_en                        :  1; /**<bit[26 : 26] */
		uint32_t bufictrl                         :  1; /**<bit[27 : 27] */
		uint32_t ibias_ctrl                       :  2; /**<bit[28 : 29] */
		uint32_t icore_ctrl                       :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_ana_reg3_t;


typedef volatile union {
	struct {
		uint32_t anabuf_sel_tx                    :  1; /**<bit[0 : 0] */
		uint32_t trng_tsten                       :  1; /**<bit[1 : 1] */
		uint32_t itune_ref                        :  3; /**<bit[2 : 4] */
		uint32_t itune_opa                        :  3; /**<bit[5 : 7] */
		uint32_t itune_cmp                        :  3; /**<bit[8 : 10] */
		uint32_t rnooise_sel                      :  1; /**<bit[11 : 11] */
		uint32_t fslow_sel                        :  3; /**<bit[12 : 14] */
		uint32_t ffast_sel                        :  4; /**<bit[15 : 18] */
		uint32_t trng_tstck_sel                   :  1; /**<bit[19 : 19] */
		uint32_t cktst_sel                        :  2; /**<bit[20 : 21] */
		uint32_t ck_tst_enbale                    :  1; /**<bit[22 : 22] */
		uint32_t sw_bias                          :  1; /**<bit[23 : 23] */
		uint32_t crb                              :  4; /**<bit[24 : 27] */
		uint32_t port_enablel                     :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_ana_reg4_t;


typedef volatile union {
	struct {
		uint32_t en_usb                           :  1; /**<bit[0 : 0] */
		uint32_t en_xtall                         :  1; /**<bit[1 : 1] */
		uint32_t en_dco                           :  1; /**<bit[2 : 2] */
		uint32_t en_ram                           :  1; /**<bit[3 : 3] */
		uint32_t en_temp                          :  1; /**<bit[4 : 4] */
		uint32_t en_dpll                          :  1; /**<bit[5 : 5] */
		uint32_t en_cb                            :  1; /**<bit[6 : 6] */
		uint32_t en_lcd                           :  1; /**<bit[7 : 7] */
		uint32_t trxspi_ctrl                      :  2; /**<bit[8 : 9] */
		uint32_t adc_div                          :  2; /**<bit[10 : 11] */
		uint32_t usb_speed                        :  1; /**<bit[12 : 12] */
		uint32_t spideepsleep                     :  1; /**<bit[13 : 13] */
		uint32_t vsel                             :  1; /**<bit[14 : 14] */
		uint32_t swb                              :  1; /**<bit[15 : 15] */
		uint32_t itune_xtall                      :  4; /**<bit[16 : 19] */
		uint32_t xtall_ten                        :  1; /**<bit[20 : 20] */
		uint32_t rosc_tsten                       :  1; /**<bit[21 : 21] */
		uint32_t bcal_start                       :  1; /**<bit[22 : 22] */
		uint32_t bcal_en                          :  1; /**<bit[23 : 23] */
		uint32_t bcal_sel                         :  3; /**<bit[24 : 26] */
		uint32_t vbias                            :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_ana_reg5_t;


typedef volatile union {
	struct {
		uint32_t calib_interval                   : 10; /**<bit[0 : 9] */
		uint32_t modify_interval                  :  6; /**<bit[10 : 15] */
		uint32_t xtal_wakeup_time                 :  4; /**<bit[16 : 19] */
		uint32_t spi_trig                         :  1; /**<bit[20 : 20] */
		uint32_t modifi_auto                      :  1; /**<bit[21 : 21] */
		uint32_t calib_auto                       :  1; /**<bit[22 : 22] */
		uint32_t cal_mode                         :  1; /**<bit[23 : 23] */
		uint32_t manu_ena                         :  1; /**<bit[24 : 24] */
		uint32_t manu_cin                         :  7; /**<bit[25 : 31] */
	};
	uint32_t v;
} sys_ana_reg6_t;


typedef volatile union {
	struct {
		uint32_t port_enablel                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg7_t;


typedef volatile union {
	struct {
		uint32_t ioldo_lp                         :  1; /**<bit[0 : 0] */
		uint32_t coreldo_hp                       :  1; /**<bit[1 : 1] */
		uint32_t dldohp                           :  1; /**<bit[2 : 2] */
		uint32_t t_vanaldosel                     :  3; /**<bit[3 : 5] */
		uint32_t r_vanaldosel                     :  3; /**<bit[6 : 8] */
		uint32_t en_trsw                          :  1; /**<bit[9 : 9] */
		uint32_t aldohp                           :  1; /**<bit[10 : 10] */
		uint32_t anacurlim                        :  1; /**<bit[11 : 11] */
		uint32_t violdosel                        :  3; /**<bit[12 : 14] */
		uint32_t iocurlim                         :  1; /**<bit[15 : 15] */
		uint32_t valoldosel                       :  3; /**<bit[16 : 18] */
		uint32_t alopowsel                        :  1; /**<bit[19 : 19] */
		uint32_t en_fast_aloldo                   :  1; /**<bit[20 : 20] */
		uint32_t aloldohp                         :  1; /**<bit[21 : 21] */
		uint32_t bgcal                            :  6; /**<bit[22 : 27] */
		uint32_t vbgcalmode                       :  1; /**<bit[28 : 28] */
		uint32_t vbgcalstart                      :  1; /**<bit[29 : 29] */
		uint32_t pwd_bgcal                        :  1; /**<bit[30 : 30] */
		uint32_t spi_envbg                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg8_t;


